// var a = 1;
// var b = 5;
// // var sum = a + b;

// a += 5 // a = a + 5;   
// a *= 5 // a = a * 5;   

// var a = 3;
//  a++;// a = a + 1;

// var a = 3;
// var b = 0;

// b = a++; // post increment - קידום מאוחר - ביצוע הפקודה הנוספת ורק אחריה -  הקידום
// //b = 3
// //a  = 4;

// var a = 3; // קידום מוקדם - ביצוע הקידום ורק לאחריו ביצוע הפקודה הנוספת
// var b = ++a;

//b = 4;
//a = 4;


var a = 3;
// if (a++ === 3) {
//     console.log('true');
// }

if (3 === ++a) {
    console.log('true')
}